<a href="https://colab.research.google.com/github/mehmetsar/modules_and_packages/blob/main/Dataframe1_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [ ]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [ ]:
myindex=["california","ny","az","tx"]

In [ ]:
mycolumns=['jan',"feb","mar"]

In [ ]:
df =pd.DataFrame(mydata, index =myindex,columns=mycolumns )
df

            jan  feb  mar
california   95   11   81
ny           70   63   87
az           75    9   77
tx           40    4   63

In [ ]:
df.info

<bound method DataFrame.info of             jan  feb  mar
california   95   11   81
ny           70   63   87
az           75    9   77
tx           40    4   63>

In [13]:
pwd

'/content'

In [14]:
ls

sample_data/

In [15]:
df = pd.read_csv("tips.csv")

In [16]:
df

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [17]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [21]:
df.head(10)

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
5       25.29  4.71    Male  ...          Erik Smith   213140353657882    Sun9679
6        8.77  2.00    Male  ...  Kristopher Johnson  2223727524230344    Sun5985
7       26.88  3.12    Male  ...         Robert Buck  3514785077705092    Sun8157
8       15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9       14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775

[10 rows x 11 columns]

In [22]:
df.tail(10)

     total_bill   tip     sex  ...       Payer Name         CC Number Payment ID
234       15.53  3.00    Male  ...    Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...    Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...    Matthew Myers  3543676378973965    Sat5032
237       32.83  1.17    Male  ...     Thomas Brown  4284722681265508    Sat2929
238       35.83  4.67  Female  ...   Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...    Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...   Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...       Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...     Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...  Michelle Hardin  3511451626698139    Thur672

[10 rows x 11 columns]

In [24]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15